{
    "NAV": {
      "ABOUT": "About me",
      "SKILLS": "Skills",
      "PORTFOLIO": "Portfolio",
      "CONTACT": "Contact"
    },
    "ME": {
      "IAM": "I am",
      "BUTTON": "Let's talk!",
      "SCROLL": "Scroll down"
    },
    "ABOUT": {
      "TITLE": "About me",
      "INTRO": "Digital solutions developed with heart, mind, and a passion for design. After many years in the industry, I found my new professional home in web development. Whether it's a website, application, or interactive idea – I love building structures, finding creative paths, solving problems, and refining every detail until everything runs smoothly. And that special feeling when it all works in the end? Simply indescribable.",
      "LOCATION": "Based in Gengenbach in the Black Forest, I’m open to remote work, freelance projects, or permanent positions. On-site? Gladly by arrangement – I'm excited about new opportunities.",
      "LEARNING": "Every challenge is a chance to grow. I look forward to learning continuously, discovering new technologies, and sharpening my skills – always aiming for the best possible outcome.",
      "SOLVE": "Solving problems means approaching things creatively and with structure. Determination, analytical thinking, and good collaboration are essential to me for finding the best solution."
    }, 
    "SKILLS": {
      "CURRENT": "I create smart, aesthetic, and functional web solutions using modern skills and tools.",
      "QUESTION": "Looking for <span class='highlight'>another skill</span>?",
      "LEARNING": "I'm excited to learn new skills to make every project a success.",
      "CONTACT": "Get in touch",
      "IMG_LERN": "Continiually lerning"
    },
    "PORTFOLIO": {
      "INTRO": "Dive into my project world – interactive, responsive, and crafted with passion.",
      "BUTTONS": {
        "LIVE": "try out",
        "GITHUB": "GitHub"
      },
      "PROJECTS": {
        "JOIN": {
          "DESCRIPTION": "A modern task management tool that simplifies teamwork. Featuring intuitive drag-and-drop, user management, status tracking, and a responsive interface."
        },
        "POKEDEX": {
          "DESCRIPTION": "An interactive Pokédex with API integration, detailed info, type assignments, search function, and a lovingly designed presentation of each Pokémon."
        },
        "ELPOLLOLOCO": {
          "DESCRIPTION": "A Jump'n'Run game – developed with object-oriented JavaScript. With animated characters, sound effects, various difficulty levels, and dynamic gameplay, El Pollo Loco is a project full of attention to detail. Help our Mexican friend Pepe take down the crazy chickens. ¡Arriba!"
        },
        "PORTFOLIO": {
          "DESCRIPTION": "My personal portfolio – modern, performant, and modularly structured."
        }
      }
    }
  }
  